# В результате 10 независимых измерений некоторой величины X, выполненных с одинаковой точностью, получены опытные данные:
# 6.9, 6.1, 6.2, 6.8, 7.5, 6.3, 6.4, 6.9, 6.7, 6.1
# Предполагая, что результаты измерений подчинены нормальному закону распределения вероятностей,оценить истинное значение величины X 
# при помощи доверительного интервала, покрывающего это значение с доверительной вероятностью 0,95.

import math
import numpy as np
from scipy import stats

x=np.array([6.9, 6.1, 6.2, 6.8, 7.5, 6.3, 6.4, 6.9, 6.7, 6.1])
xmean=np.mean(x)
print(xmean)
print(len(x))    
D=np.var(x,ddof=1)                                # несмещенная дисперсия для выборки x
print(D)
t=stats.t.ppf(0.975,len(x)-1)
print(t)
a=xmean-t*np.sqrt(D/len(x))
b=xmean+t*np.sqrt(D/len(x))
print(f'Доверительный интервал: {[a , b]}')
