# Рост дочерей 175, 167, 154, 174, 178, 148, 160, 167, 169, 170
# Рост матерей 178, 165, 165, 173, 168, 155, 160, 164, 178, 175
# Используя эти данные построить 95% доверительный интервал для разности среднего роста родителей и детей.

import math
import numpy as np
from scipy import stats

x1=np.array([175, 167, 154, 174, 178, 148, 160, 167, 169, 170])
x2=np.array([178, 165, 165, 173, 168, 155, 160, 164, 178, 175])
x1mean=np.mean(x1)
x2mean=np.mean(x2)
print(x1mean)
print(x2mean)
delta=x2mean-x1mean                                 # разность среднего роста родителей и детей
print(delta)
D1=np.var(x1,ddof=1)                                # несмещенная дисперсия для выборки x1
D2=np.var(x2,ddof=1)                                # несмещенная дисперсия для выборки x2
print(D1)
print(D2)
D=(D1+D2)/2                                         # объединенная оценка дисперсии
print(D)
SE=np.sqrt(D/len(x1)+D/len(x2))                     # стандартная ошибка разности средних
print(SE)
t=stats.t.ppf(0.975,18)                             
print(t)
a=delta-t*SE
b=delta+t*SE
print(f'Доверительный интервал: {[a , b]}')