# Известно, что генеральная совокупность распределена нормально со средним квадратическим отклонением, равным 16.
# Найти доверительный интервал для оценки математического ожидания a с надежностью 0.95, если выборочная средняя M = 80, а объем выборки n = 256.
import scipy.stats as stats
sigma=16
M = 80
n = 256
z1=stats.t.ppf(0.975,n-1)        # 1.9693105698491928
a=M-z1*sigma/n**0.5
b=M+z1*sigma/n**0.5
print(f'Доверительный интервал: {[a , b]}')

